---
kind: property
id: P:Autodesk.Revit.DB.MEPSize.InnerDiameter
source: html/b0e6d8e3-b6c5-5613-aeb1-d6240b893e66.htm
---
# Autodesk.Revit.DB.MEPSize.InnerDiameter Property

Inner diameter

## Syntax (C#)
```csharp
public double InnerDiameter { get; }
```